package com.sage.everyapart.apartmentservice.adaptor.out.go_openapi

import com.fasterxml.jackson.databind.ObjectMapper
import io.kotest.core.spec.style.BehaviorSpec
import org.assertj.core.api.Assertions
import org.assertj.core.api.Assertions.*

val contents = "{\n  \"response\":{\n    \"header\":{\n      \"resultCode\":\"00\",\"resultMsg\":\"NORMAL SERVICE.\"\n    },\n    \"body\":{\n      \"items\":{\n        \"item\":[\n          {\n            \"거래금액\":\"     200,000\",\n            \"거래유형\":\"중개거래\",\n            \"건축년도\":2008,\n            \"년\":2023,\n            \"등기일자\":\"23.01.20\",\n            \"법정동\":\" 사직동\",\n            \"아파트\":\"광화문스페이스본(106동)\",\n            \"월\":1,\n            \"일\":20,\n            \"전용면적\":163.33,\n            \"중개사소재지\":\"서울 종로구\",\n            \"지번\":\"9-1\",\n            \"지역코드\":11110,\n            \"층\":12,\n            \"해제사유발생일\":\" \",\n            \"해제여부\":\" \"\n          }\n        ,{\"거래금액\":\"      79,000\",\"거래유형\":\"중개거래\",\"건축년도\":2006,\"년\":2023,\"등기일자\":\"23.02.28\",\"법정동\":\" 인의동\",\"아파트\":\"효성쥬얼리시티\",\"월\":1,\"일\":26,\"전용면적\":84.7,\"중개사소재지\":\"서울 종로구\",\"지번\":\"48-2\",\"지역코드\":11110,\"층\":17,\"해제사유발생일\":\" \",\"해제여부\":\" \"},{\"거래금액\":\"      12,200\",\"거래유형\":\"중개거래\",\"건축년도\":2014,\"년\":2023,\"등기일자\":\"23.01.31\",\"법정동\":\" 숭인동\",\"아파트\":\"숭인한양LEEPS\",\"월\":1,\"일\":20,\"전용면적\":12.78,\"중개사소재지\":\"서울 종로구\",\"지번\":\"1421-2\",\"지역코드\":11110,\"층\":7,\"해제사유발생일\":\" \",\"해제여부\":\" \"},{\"거래금액\":\"     169,000\",\"거래유형\":\"중개거래\",\"건축년도\":2017,\"년\":2023,\"등기일자\":\" \",\"법정동\":\" 홍파동\",\"아파트\":\"경희궁자이(2단지)\",\"월\":1,\"일\":27,\"전용면적\":84.8359,\"중개사소재지\":\"서울 종로구\",\"지번\":199,\"지역코드\":11110,\"층\":12,\"해제사유발생일\":\" \",\"해제여부\":\" \"},{\"거래금액\":\"      18,900\",\"거래유형\":\"중개거래\",\"건축년도\":1997,\"년\":2023,\"등기일자\":\"23.04.07\",\"법정동\":\" 평창동\",\"아파트\":\"갑을아파트\",\"월\":1,\"일\":28,\"전용면적\":30.46,\"중개사소재지\":\"서울 종로구\",\"지번\":595,\"지역코드\":11110,\"층\":6,\"해제사유발생일\":\" \",\"해제여부\":\" \"},{\"거래금액\":\"     155,500\",\"거래유형\":\"중개거래\",\"건축년도\":2008,\"년\":2023,\"등기일자\":\"23.02.28\",\"법정동\":\" 무악동\",\"아파트\":\"인왕산아이파크\",\"월\":1,\"일\":10,\"전용면적\":114.931,\"중개사소재지\":\"경기 고양덕양구, 서울 종로구\",\"지번\":60,\"지역코드\":11110,\"층\":16,\"해제사유발생일\":\" \",\"해제여부\":\" \"},{\"거래금액\":\"      99,960\",\"거래유형\":\"중개거래\",\"건축년도\":2000,\"년\":2023,\"등기일자\":\"23.04.28\",\"법정동\":\" 무악동\",\"아파트\":\"현대\",\"월\":1,\"일\":26,\"전용면적\":84.92,\"중개사소재지\":\"서울 종로구\",\"지번\":82,\"지역코드\":11110,\"층\":6,\"해제사유발생일\":\" \",\"해제여부\":\" \"}]\n      },\n      \"numOfRows\":10,\n      \"pageNo\":1,\n      \"totalCount\":7}\n  }\n}\n"
//val contents = "{\n  \"response\":{\n    \"body\":{\n      \"items\":{\n      },\n      \"numOfRows\":10,\n      \"pageNo\":1,\n      \"totalCount\":7}\n  }\n}\n"

class ApartmentTransactionDataJsonResponseTest : BehaviorSpec({

    Given("응답이 주어졌을때"){
        val objectMapper: ObjectMapper = ObjectMapper();

        When("변환 시도시"){
            val result = objectMapper.readValue(contents, ApartmentTransactionDataJsonResponse::class.java)

            Then("잘 변환된다."){
                assertThat(result).isNotNull()
            }

        }

    }



})
